app/controllers/estorias_controller.rb

SELECT * FROM `estorias`
---
  def index
	@estorias = Estoria.all

SELECT * FROM `estorias` WHERE (`estorias`.`id` = 1)
---
  def show
    @estoria = Estoria.find(params[:id])

INSERT INTO `estorias` (`data`, `created_at`, `titulo`, `updated_at`, `ativo`, `descricao`, `categoria_id`) VALUES('2010-06-04 00:00:00', '2010-06-04 12:58:11', 'dar o fora desse maldito lugar', '2010-06-04 12:58:11', NULL, 'sair daqui para estralar um dotinha', 3)
---
  def create
    @estoria = Estoria.new(params[:estoria])
    if @estoria.save

SELECT * FROM `estorias` WHERE (`estorias`.`id` = 1)
---
  def edit
    @estoria = Estoria.find(params[:id])

SELECT * FROM `estorias` WHERE (`estorias`.`id` = 1)
UPDATE `estorias` SET `updated_at` = '2010-04-04 00:03:17', `descricao` = ' bater uma EDITADO' WHERE `id` = 9
---
  def update
    @estoria = Estoria.find(params[:id])
    if @estoria.update_attributes(params[:estoria])

SELECT * FROM `estorias` WHERE (`estorias`.`id` = 4)
DELETE FROM `estorias` WHERE `id` = 4
---
  def destroy
    @estoria = Estoria.find(params[:id])
    @estoria.destroy