app/controllers/sprints_controller.rb

  def index
    @sprints = Sprint.all
---
SELECT * FROM `sprints`

  def show
    @sprint = Sprint.find(params[:id])
---
SELECT * FROM `sprints` WHERE (`sprints`.`id` = 1)

  def edit
    @sprint = Sprint.find(params[:id])
---
SELECT * FROM `sprints` WHERE (`sprints`.`id` = 1)

  def create
    @sprint = Sprint.new(params[:sprint])

    respond_to do |format|
      if @sprint.save
---
INSERT INTO `sprints` (`pontos`, `dtinicio`, `created_at`, `updated_at`, `ret_bom`, `ret_ruim`, `dtfim`, `objetivo`) VALUES(222, '2008-04-11', '2010-08-11 14:22:13', '2010-08-11 14:22:13', NULL, NULL, '2007-09-11', 'Testar a inclusão de Sprints')

  def update
    @sprint = Sprint.find(params[:id])

    respond_to do |format|
      if @sprint.update_attributes(params[:sprint])
---
SELECT * FROM `sprints` WHERE (`sprints`.`id` = 1)
UPDATE `sprints` SET `updated_at` = '2010-08-11 14:22:51', `dtfim` = '2011-09-11', `ret_ruim` = '', `ret_bom` = '' WHERE `id` = 1

  def destroy
    @sprint = Sprint.find(params[:id])
    @sprint.destroy
---
SELECT * FROM `sprints` WHERE (`sprints`.`id` = 980190962)
DELETE FROM `sprints` WHERE `id` = 980190962