app/controllers/sprint_diarios_controller.rb

SELECT * FROM `sprint_diarios`
---
  def index
    @sprint_diarios = SprintDiario.all

SELECT * FROM `sprint_diarios` WHERE (`sprint_diarios`.`id` = 980190962)
---
  def show
    @sprint_diario = SprintDiario.find(params[:id])

SELECT * FROM `sprint_diarios` WHERE (`sprint_diarios`.`id` = 980190962)
---
  def edit
    @sprint_diario = SprintDiario.find(params[:id])

INSERT INTO `sprint_diarios` (`sprint_id`, `tarefa_id`, `created_at`, `tarefa_pontos`, `updated_at`, `dia`) VALUES(NULL, NULL, '2010-08-22 14:08:58', NULL, '2010-08-22 14:08:58', NULL)
---
  def create
    @sprint_diario = SprintDiario.new(params[:sprint_diario])

    respond_to do |format|
      if @sprint_diario.save

SELECT * FROM `sprint_diarios` WHERE (`sprint_diarios`.`id` = 980190962)
---
  def update
    @sprint_diario = SprintDiario.find(params[:id])

SELECT * FROM `sprint_diarios` WHERE (`sprint_diarios`.`id` = 980190962)
DELETE FROM `sprint_diarios` WHERE `id` = 980190962
---
  def destroy
    @sprint_diario = SprintDiario.find(params[:id])
    @sprint_diario.destroy