app/controllers/tarefas_controller.rb

  def index
	#@tarefas = Tarefa.all
	@tarefas = Tarefa.all(:conditions => { :estoria_id => params[:estoria_id]  })
---
SELECT * FROM `tarefas` WHERE (`tarefas`.`estoria_id` IS NULL)

  def show
    @tarefa = Tarefa.find(params[:id])
---
SELECT * FROM `tarefas` WHERE (`tarefas`.`id` = 1)

  def edit
    @tarefa = Tarefa.find(params[:id])
---
SELECT * FROM `tarefas` WHERE (`tarefas`.`id` = 1)

  def create
    @tarefa = Tarefa.new(params[:tarefa])


    respond_to do |format|
      if @tarefa.save
---
INSERT INTO `tarefas` (`pontos`, `sprint_id`, `data`, `nome_user_resp`, `created_at`, `andamento_id`, `titulo`, `estoria_id`, `updated_at`, `descricao`, `login_user_resp`) VALUES(12, NULL, '2010-08-12 00:00:00', 'ivan', '2010-08-12 12:36:30', 1, 'Tarefa para a estoria 16', 16, '2010-08-12 12:36:30', 'fdfdfsdf', 'ivan')

  def update
    @tarefa = Tarefa.find(params[:id])
---
SELECT * FROM `tarefas` WHERE (`tarefas`.`id` = 1)

  def destroy
    @tarefa = Tarefa.find(params[:id])
    @tarefa.destroy
---
SELECT * FROM `tarefas` WHERE (`tarefas`.`id` = 1)
DELETE FROM `tarefas` WHERE `id` = 1