app/controllers/users_controller.rb

INSERT INTO `users` (`name`, `salt`, `created_at`, `crypted_password`, `remember_token_expires_at`, `updated_at`, `remember_token`, `login`, `email`) VALUES('', '4278ae496d3ded82df9a37ce03e677365f1c6306', '2010-08-22 14:08:58', '8f6519000dec484649247fcb5418fdd07559d9e1', NULL, '2010-08-22 14:08:58', NULL, 'quire', 'quire@example.com')
---
  def create
    logout_keeping_session!
    @user = User.new(params[:user])
    success = @user && @user.save